src/Documents/уатРассылкаЭлектронныхПисем_уэ/уатРассылкаЭлектронныхПисем_уэ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатРассылкаЭлектронныхПисем_уэ</name>
  <basedOn>Document.уатТендер_уэ</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.уатТендер_уэ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонСообщения</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеАдреса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/уатРассылкаЭлектронныхПисем_уэ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	уатОбщегоНазначенияСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументОбъект.уатТендер_уэ") Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатТендер_уэ") Тогда
		Дата          = ТекущаяДата();
		Основание     = ДанныеЗаполнения.Ссылка;
		Организация   = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		
		Для Каждого ТекСтрока Из ДанныеЗаполнения.Перевозчики Цикл 
			Если Не ТекСтрока.СпособЗапроса = Справочники.уатСпособыВзаимодействий_уэ.ЭлектронноеПисьмо Тогда 
				Продолжить;
			КонецЕсли;
			
			НовыйПолучатель = Получатели.Добавить();
			НовыйПолучатель.Контрагент     = ТекСтрока.Перевозчик;
			НовыйПолучатель.КонтактноеЛицо = ТекСтрока.Перевозчик.ОсновноеКонтактноеЛицо;
			
			СписокАдресов = Документы.уатРассылкаЭлектронныхПисем_уэ.СформироватьСписокАдресов(Новый Структура("Контрагент, КонтактноеЛицо",НовыйПолучатель.Контрагент,НовыйПолучатель.КонтактноеЛицо));
			Если СписокАдресов.Количество() > 0 Тогда
				стрАдрес = СписокАдресов[0].Значение;
				Если НЕ стрАдрес.Количество() = 0 Тогда
					НовыйПолучатель.Адрес               = стрАдрес.Представление;
					НовыйПолучатель.ПредставлениеАдреса = ?(стрАдрес.Объект = НовыйПолучатель.Контрагент,Строка(НовыйПолучатель.Контрагент),Строка(НовыйПолучатель.КонтактноеЛицо)) + " <" + стрАдрес.Представление + ">";
				Иначе
					НовыйПолучатель.Адрес               = "";
					НовыйПолучатель.ПредставлениеАдреса = "";
				КонецЕсли;
			Иначе
				НовыйПолучатель.Адрес               = "";
				НовыйПолучатель.ПредставлениеАдреса = "";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ЭтотОбъект);
	уатОбщегоНазначения.ПроверкаЗаполненияПодразделения(Организация, Подразделение, Отказ, Заголовок);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
